
import matplotlib.pyplot as plt
import numpy as np
import matplotlib
matplotlib.use('TkAgg')
plt.rcParams['font.sans-serif'] = ['SimHei']  # 用来正常显示中文
plt.rcParams['axes.unicode_minus'] = False    # 用来正常显示负号


# with open('distance.txt','r') as f:
#     x_temp = f.read().splitlines()
# with open('time.txt','r') as f:
#     y_temp = f.read().splitlines()
# for i in range(len(x_temp)):
#     x2.append(int(x_temp[i]))
#     y1.append(float(y_temp[i]))

x1 = []
x2 = [1079, 1079, 1079, 1079, 1079, 1087, 1110, 1116, 1116, 1116, 1116, 1131, 1145, 1194, 1197, 1211, 1232, 1242, 1252, 1263, 1267, 1274, 1287, 1287, 1291, 1295, 1295, 1295, 1295, 1295, 1295, 1295, 1295, 1295, 1295, 1295]
for i in x2:
    i = i - 1079
    x1.append(i)

# x3 = x1[1:]
# x = [x1[i]-x1[i-1] for i in range(1,len(x1))]

y1 = [0.0, 0.2306346893310547, 0.3436410427093506, 0.45230913162231445, 0.5650358200073242, 0.6668679714202881, 0.7737655639648438, 0.8814787864685059, 0.9901237487792969, 1.0910420417785645, 1.1989777088165283, 1.306955337524414, 1.4157354831695557, 1.5241496562957764, 1.6323270797729492, 1.7405312061309814, 1.846977949142456, 1.9555964469909668, 2.0556023120880127, 2.1557300090789795, 2.2661731243133545, 2.3734076023101807, 2.4818074703216553, 2.5890185832977295, 2.690173387527466, 2.798997640609741, 2.9067461490631104, 3.007749319076538, 3.1149678230285645, 3.2222001552581787, 3.330505609512329, 3.433826446533203, 3.5418190956115723, 3.6495792865753174, 3.7496213912963867, 3.8496334552764893]
# print(x)
# y = [y1[i]-y1[i-1] for i in range(1,len(y1))]
# print(y)
z1 = np.polyfit(x1, y1, 3)  # 用3次多项式拟合，输出系数从高到0
p1 = np.poly1d(z1)  # 使用次数合成多项式
y_pre = p1(x1)
print(len(x1),len(y1))
print(p1)
print(z1)
print(y_pre)
plt.plot(x1, y1, '.')
plt.plot(x1, y_pre)
plt.savefig('nihe2.png')
plt.show()




















